app/views/teaches/_form.html.erb

    <%= f.label :teacher_id %><br>
    <%= f.collection_select(:teacher_id, Teacher.all, :id, :name) %>
---
SELECT "teachers".* FROM "teachers"

    <%= f.label :subject_id %><br>
    <%= f.collection_select(:subject_id, Subject.all, :id, :subject_title) %>
---
SELECT "subjects".* FROM "subjects"