app/views/studies/_form.html.erb


     <%= f.collection_select(:subject_id, Subject.all, :id, :subject_title) %>
---
SELECT "subjects".* FROM "subjects"

    <%= f.label :student_id %><br>
    <%= f.collection_select(:student_id, Student.all, :id, :student_name) %>
---
SELECT "students".* FROM "students"