backupfiles/app/controllers/students_controller.rb

INSERT INTO "students" ("student_name", "father_name", "course", "semester", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["student_name", "M"], ["father_name", ""], ["course", ""], ["semester", ""], ["created_at", "2015-06-08 17:41:46.371466"], ["updated_at", "2015-06-08 17:41:46.371466"]]
---
  def create
    @student = Student.new(student_params)

    respond_to do |format|
      if @student.save

UPDATE "students" SET "student_name" = $1, "father_name" = $2, "rollnumber" = $3, "course" = $4, "semester" = $5, "updated_at" = $6 WHERE "students"."id" = $7  [["student_name", "Muhammad Rafiq"], ["father_name", "H Sher Muhammad"], ["rollnumber", 44], ["course", "MCS"], ["semester", "4th"], ["updated_at", "2015-06-08 17:42:30.022080"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @student.update(student_params)