backupfiles/app/controllers/teaches_controller.rb

SELECT "teaches".* FROM "teaches"
---
  def index
    @teaches = Teach.all

INSERT INTO "teaches" ("teacher_id", "subject_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["teacher_id", 1], ["subject_id", 1], ["created_at", "2015-06-04 11:23:05.290802"], ["updated_at", "2015-06-04 11:23:05.290802"]]
---
  def create
    @teach = Teach.new(teach_params)

    respond_to do |format|
      if @teach.save

DELETE FROM "teaches" WHERE "teaches"."id" = $1  [["id", 1]]
---
  def destroy
    @teach.destroy

SELECT  "teaches".* FROM "teaches" WHERE "teaches"."id" = $1 LIMIT 1  [["id", 2]]
---
    def set_teach
      @teach = Teach.find(params[:id])