app/controllers/attendances_controller.rb

SELECT "attendances".* FROM "attendances"
---
  def index
    @attendances = Attendance.all

INSERT INTO "attendances" ("month", "subject", "status", "student_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["month", "June"], ["subject", "Web Engineering"], ["status", "P"], ["student_id", 1], ["created_at", "2015-06-04 11:24:55.715381"], ["updated_at", "2015-06-04 11:24:55.715381"]]
---
  def create
    @attendance = Attendance.new(attendance_params)

    respond_to do |format|
      if @attendance.save

UPDATE "attendances" SET "subject" = $1, "updated_at" = $2 WHERE "attendances"."id" = $3  [["subject", "Web Engineering"], ["updated_at", "2015-06-08 17:47:06.824313"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @attendance.update(attendance_params)

DELETE FROM "attendances" WHERE "attendances"."id" = $1  [["id", 4]]
---
  def destroy
    @attendance.destroy

SELECT  "attendances".* FROM "attendances" WHERE "attendances"."id" = $1 LIMIT 1  [["id", 4]]
---
    def set_attendance
      @attendance = Attendance.find(params[:id])