app/controllers/studies_controller.rb

  def index
    @studies = Study.all
---
SELECT "studies".* FROM "studies"

  def create
    @study = Study.new(study_params)

    respond_to do |format|
      if @study.save
---
INSERT INTO "studies" ("subject_id", "student_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["subject_id", 1], ["student_id", 1], ["created_at", "2015-06-04 11:23:47.633590"], ["updated_at", "2015-06-04 11:23:47.633590"]]

  def destroy
    @study.destroy
---
DELETE FROM "studies" WHERE "studies"."id" = $1  [["id", 4]]

    def set_study
      @study = Study.find(params[:id])
---
SELECT  "studies".* FROM "studies" WHERE "studies"."id" = $1 LIMIT 1  [["id", 5]]