app/controllers/subjects_controller.rb

SELECT "subjects".* FROM "subjects"
---
  def index
    @subjects = Subject.all

INSERT INTO "subjects" ("subject_code", "subject_title", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["subject_code", "1324"], ["subject_title", "Web Engineering"], ["created_at", "2015-06-04 11:16:15.359921"], ["updated_at", "2015-06-04 11:16:15.359921"]]
---
  def create
    @subject = Subject.new(subject_params)

    respond_to do |format|
      if @subject.save

DELETE FROM "subjects" WHERE "subjects"."id" = $1  [["id", 1]]
---
  def destroy
    @subject.destroy

SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_subject
      @subject = Subject.find(params[:id])