app/controllers/welcome_controller.rb

  def show
  @students = Student.all
  @studies = Study.all
  @subjects = Subject.all
  @attendances = Attendance.all
  @teahcers = Teacher.all
  @teaches = Teach.all
---
SELECT "students".* FROM "students"
SELECT "studies".* FROM "studies"
SELECT "subjects".* FROM "subjects"
SELECT "attendances".* FROM "attendances"
SELECT "teaches".* FROM "teaches"