backupfiles/app/views/attendances/_form.html.erb

    <%= f.label :student_id %><br>
    <%= f.collection_select(:student_id, Student.all, :id, :student_name) %>
---
SELECT "students".* FROM "students"